"""
Актуальная формулировка ДЗ:

Важное:
    1. Если поле идейно числовое - превращайте строку в число.
    2. Проект должен быть целиком на git, чтобы его можно было запустить как из runner.py, так и из командной строки
Что необходимо:
    1. Доработать паука в имеющемся проекте, чтобы он складывал все записи в БД (любую, ожидаемо - в MongoDB)
    и формировал item по структуре:
        - Наименование вакансии,
        - Зарплата от,
        - Зарплата до,
        - Валюта зарплаты,
        - Ссылку на саму вакансию,
        - Сайт откуда собрана вакансия.
    2. (Обязательно!) Создать в имеющемся проекте второго паука по сбору вакансий с сайта superjob.
    Паук должен формировать item'ы по аналогичной структуре и складывать данные также в БД.
    (Подумайте про обновление! Вам ведь нужна актуальная информация по вакансии)
    3. Подумайте каким образом можно используя input() кастомизировать сбор данных для разных поисковых запросов.
"""